
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/5c36d845-c623-4608-9113-f224d1f41f23/terraform-bin plan -no-color
2024-06-06T23:04:35.479Z [INFO]  Terraform version: 1.8.1
2024-06-06T23:04:35.479Z [INFO]  Go runtime version: go1.22.1
2024-06-06T23:04:35.479Z [INFO]  CLI args: []string{"/home/runner/work/_temp/5c36d845-c623-4608-9113-f224d1f41f23/terraform-bin", "plan", "-no-color"}
2024-06-06T23:04:35.479Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-06-06T23:04:35.486Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-06-06T23:04:36.238Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-06-06T23:04:36.416Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-06-06T23:04:36.795Z [INFO]  backend/local: starting Plan operation
2024-06-06T23:04:37.457Z [INFO]  backend-s3: Locking remote state: tf_backend.lock.id=63374e88-1163-742f-47b3-b0130bc6cdf5 tf_backend.lock.info="" tf_backend.lock.operation=OperationTypePlan tf_backend.lock.path=algosolved-terraform-s3/infra/prod/terraform.tfstate tf_backend.lock.version=1.8.1 tf_backend.lock.who=runner@fv-az1427-422 tf_backend.operation=Lock tf_backend.req_id=d42cf791-57d4-c2e5-6059-22004259f33e tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
Acquiring state lock. This may take a few moments...
2024-06-06T23:04:38.037Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=5ee0c396-e121-8e5c-dc29-a964e7332d6c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-06-06T23:04:38.844Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:38.861Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:38.861Z
2024-06-06T23:04:38.912Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:38.983Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:38.983Z
2024-06-06T23:04:39.590Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:39.599Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.599Z
2024-06-06T23:04:39.630Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:39.638Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.638Z
2024-06-06T23:04:39.661Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:39.669Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.669Z
2024-06-06T23:04:39.717Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:39.797Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.796Z
2024-06-06T23:04:39.922Z [INFO]  backend/local: plan calling Plan
2024-06-06T23:04:39.928Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:39.936Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.936Z
2024-06-06T23:04:39.959Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:40.039Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:40.039Z
2024-06-06T23:04:40.063Z [INFO]  provider: configuring client automatic mTLS
2024-06-06T23:04:40.074Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:40.073Z
random_string.password: Refreshing state... [id=M9axbhdBAI9j4gg4]
data.archive_file.scale_in_lambda_to_zip: Reading...
data.archive_file.scale_out_lambda_to_zip: Reading...
data.archive_file.scale_in_lambda_to_zip: Read complete after 0s [id=3939add652a5f645d18fcb812736b4c7b6917dc0]
data.archive_file.scale_out_lambda_to_zip: Read complete after 0s [id=ecddb466acb0c38687624ecf9b5e4842a008f2f8]
2024-06-06T23:04:40.166Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_req_id=1b44760b-2727-194a-04a8-828be64983b8 tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-06-06T23:04:40.166Z
2024-06-06T23:04:40.899Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_req_id=1b44760b-2727-194a-04a8-828be64983b8 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2024-06-06T23:04:40.899Z
data.aws_ami.ubuntu: Reading...
aws_lambda_permission.scale_out_lambda_perm: Refreshing state... [id=terraform-20240603164448751100000001]
aws_cloudwatch_event_rule.scale_out_rule: Refreshing state... [id=algosolved-scale-out-rule]
aws_iam_role.lambda_role: Refreshing state... [id=scalable-lambda-role]
aws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]
aws_lambda_permission.scale_in_lambda_perm: Refreshing state... [id=terraform-20240603164454120800000003]
aws_cloudwatch_event_rule.scale_in_rule: Refreshing state... [id=algosolved-scale-in-rule]
aws_cloudwatch_event_target.scale_out_target: Refreshing state... [id=algosolved-scale-out-rule-terraform-20240603164448752600000002]
aws_cloudwatch_event_target.scale_in_target: Refreshing state... [id=algosolved-scale-in-rule-terraform-20240603164454127300000004]
aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]
2024-06-06T23:04:41.150Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
aws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-04bcecd9b86d61bad]
2024-06-06T23:04:41.169Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .force_detach_policies: planned value cty.False for a non-computed attribute
aws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f]
2024-06-06T23:04:41.179Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-012edd67d8f2929e0]
aws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]
2024-06-06T23:04:41.710Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.scalable_lambda_scheduler_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-06-06T23:04:41.713Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.scalable_lambda_scheduler_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
aws_lambda_function.scale_in_lambda: Refreshing state... [id=algosolved-scale-in-lambda]
aws_lambda_function.scale_out_lambda: Refreshing state... [id=algosolved-scale-out-lambda]
aws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=scalable-lambda-role-20240530100929042100000001]
aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=scalable-lambda-role-20240530100929356100000002]
2024-06-06T23:04:42.078Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0572f73f0a5650b33]
2024-06-06T23:04:42.224Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
      - .tags_all: planned value cty.MapValEmpty(cty.String) does not match config value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")}) nor prior value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")})
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)
      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)
2024-06-06T23:04:42.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-06-06T23:04:42.316Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.scale_in_lambda during refresh.
      - .last_modified: was cty.StringVal("2024-06-04T10:17:29.000+0000"), but now cty.StringVal("2024-06-04T14:41:51.000+0000")
      - .source_code_hash: was cty.StringVal("Fa/TtvyK8ZB5ZREtZ0PWFEcECO6jcvabx1/yjQpgGGs="), but now cty.StringVal("RRRVebpkRFIY0lBWlFraieqPg7BHDpMbU1mIm8hl+yI=")
      - .source_code_size: was cty.NumberIntVal(824), but now cty.NumberIntVal(978)
2024-06-06T23:04:42.317Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.scale_out_lambda during refresh.
      - .last_modified: was cty.StringVal("2024-06-04T10:17:34.000+0000"), but now cty.StringVal("2024-06-04T12:04:20.000+0000")
      - .source_code_hash: was cty.StringVal("wGOROH2qqDoa7o+ItJvesJZAXcuC5uO3lwB4q5e5PtQ="), but now cty.StringVal("R4oAk8Fu/PtFtbwHljIiYyRsZJsIuLbG0rJIeiNHb0M=")
      - .source_code_size: was cty.NumberIntVal(827), but now cty.NumberIntVal(847)
aws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-0ab2561671d221a8a]
2024-06-06T23:04:42.330Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute
      - .publish: planned value cty.False for a non-computed attribute
      - .image_uri: planned value cty.StringVal("") for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute
      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)
      - .logging_config: block count in plan (1) disagrees with count in config (0)
      - .tracing_config: block count in plan (1) disagrees with count in config (0)
2024-06-06T23:04:42.330Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute
      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute
      - .publish: planned value cty.False for a non-computed attribute
      - .image_uri: planned value cty.StringVal("") for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .logging_config: block count in plan (1) disagrees with count in config (0)
      - .tracing_config: block count in plan (1) disagrees with count in config (0)
      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)
2024-06-06T23:04:42.418Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute
      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute
      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute
      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .health_check[0].enabled: planned value cty.True for a non-computed attribute
      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute
      - .stickiness: block count in plan (1) disagrees with count in config (0)
      - .target_failover: block count in plan (1) disagrees with count in config (0)
      - .target_health_state: block count in plan (1) disagrees with count in config (0)
2024-06-06T23:04:42.730Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .disable_api_stop: planned value cty.False for a non-computed attribute
      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute
      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute
      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute
      - .disable_api_termination: planned value cty.False for a non-computed attribute
      - .user_data: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-06-06T23:04:43.064Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .customer_owned_ipv4_pool: planned value cty.StringVal("") for a non-computed attribute
      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute
      - .enable_cross_zone_load_balancing: planned value cty.True for a non-computed attribute
      - .enable_xff_client_port: planned value cty.False for a non-computed attribute
      - .preserve_host_header: planned value cty.False for a non-computed attribute
      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute
      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute
      - .enable_http2: planned value cty.True for a non-computed attribute
      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute
      - .enable_deletion_protection: planned value cty.False for a non-computed attribute
      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute
      - .access_logs: block count in plan (1) disagrees with count in config (0)
      - .connection_logs: block count in plan (1) disagrees with count in config (0)
aws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/b2ca87625a4599c9/f8e55bf4f14dd805]
2024-06-06T23:04:43.285Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
aws_db_instance.algosolved-rdb: Refreshing state... [id=db-SNL2HKJ2U64PDP3APGN4QYFUME]
2024-06-06T23:04:43.575Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .capacity_rebalance: planned value cty.False for a non-computed attribute
      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .context: planned value cty.StringVal("") for a non-computed attribute
      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .placement_group: planned value cty.StringVal("") for a non-computed attribute
      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
2024-06-06T23:04:43.695Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute
      - .domain_auth_secret_arn: planned value cty.StringVal("") for a non-computed attribute
      - .enabled_cloudwatch_logs_exports: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .iam_database_authentication_enabled: planned value cty.False for a non-computed attribute
      - .publicly_accessible: planned value cty.False for a non-computed attribute
      - .delete_automated_backups: planned value cty.True for a non-computed attribute
      - .domain_ou: planned value cty.StringVal("") for a non-computed attribute
      - .performance_insights_enabled: planned value cty.False for a non-computed attribute
      - .apply_immediately: planned value cty.False for a non-computed attribute
      - .dedicated_log_volume: planned value cty.False for a non-computed attribute
      - .deletion_protection: planned value cty.False for a non-computed attribute
      - .replicate_source_db: planned value cty.StringVal("") for a non-computed attribute
      - .skip_final_snapshot: planned value cty.False for a non-computed attribute
      - .domain: planned value cty.StringVal("") for a non-computed attribute
      - .max_allocated_storage: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .custom_iam_instance_profile: planned value cty.StringVal("") for a non-computed attribute
      - .domain_dns_ips: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .storage_encrypted: planned value cty.False for a non-computed attribute
      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute
      - .customer_owned_ip_enabled: planned value cty.False for a non-computed attribute
      - .domain_iam_role_name: planned value cty.StringVal("") for a non-computed attribute
2024-06-06T23:04:43.700Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_scheduler_schedule.scale-in-schedule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .schedule_expression_timezone: planned value cty.StringVal("UTC") for a non-computed attribute
      - .state: planned value cty.StringVal("ENABLED") for a non-computed attribute
2024-06-06T23:04:43.700Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_scheduler_schedule.scale-out-schedule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .schedule_expression_timezone: planned value cty.StringVal("UTC") for a non-computed attribute
      - .state: planned value cty.StringVal("ENABLED") for a non-computed attribute
2024-06-06T23:04:44.129Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_action[0].target_group_arn: planned value cty.StringVal("") for a non-computed attribute
      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute
      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute
      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute
2024-06-06T23:04:44.164Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.scale_in_rule will be destroyed
  # (because aws_cloudwatch_event_rule.scale_in_rule is not in configuration)
  - resource "aws_cloudwatch_event_rule" "scale_in_rule" {
      - arn                 = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-in-rule" -> null
      - description         = "Event bridge scale-in lambda" -> null
      - event_bus_name      = "default" -> null
      - event_pattern       = jsonencode(
            {
              - asg_name       = [
                  - "algosolved-ec2-asg",
                ]
              - rds_identifier = [
                  - "algosolved-rdb",
                ]
            }
        ) -> null
      - force_destroy       = false -> null
      - id                  = "algosolved-scale-in-rule" -> null
      - is_enabled          = true -> null
      - name                = "algosolved-scale-in-rule" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.scale_out_rule will be destroyed
  # (because aws_cloudwatch_event_rule.scale_out_rule is not in configuration)
  - resource "aws_cloudwatch_event_rule" "scale_out_rule" {
      - arn                 = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-out-rule" -> null
      - description         = "Event bridge scale-out lambda" -> null
      - event_bus_name      = "default" -> null
      - event_pattern       = jsonencode(
            {
              - asg_name       = [
                  - "algosolved-ec2-asg",
                ]
              - rds_identifier = [
                  - "algosolved-rdb",
                ]
            }
        ) -> null
      - force_destroy       = false -> null
      - id                  = "algosolved-scale-out-rule" -> null
      - is_enabled          = true -> null
      - name                = "algosolved-scale-out-rule" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.scale_in_target will be destroyed
  # (because aws_cloudwatch_event_target.scale_in_target is not in configuration)
  - resource "aws_cloudwatch_event_target" "scale_in_target" {
      - arn            = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "algosolved-scale-in-rule-terraform-20240603164454127300000004" -> null
      - rule           = "algosolved-scale-in-rule" -> null
      - target_id      = "terraform-20240603164454127300000004" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.scale_out_target will be destroyed
  # (because aws_cloudwatch_event_target.scale_out_target is not in configuration)
  - resource "aws_cloudwatch_event_target" "scale_out_target" {
      - arn            = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "algosolved-scale-out-rule-terraform-20240603164448752600000002" -> null
      - rule           = "algosolved-scale-out-rule" -> null
      - target_id      = "terraform-20240603164448752600000002" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_ecr_repository.algosolved_repository will be updated in-place
  ~ resource "aws_ecr_repository" "algosolved_repository" {
        id                   = "algosolved-ecr"
        name                 = "algosolved-ecr"
      ~ tags                 = {
          - "Project" = "algosolved" -> null
          - "Stage"   = "prod" -> null
        }
      ~ tags_all             = {
          - "Project" = "algosolved" -> null
          - "Stage"   = "prod" -> null
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.scalable_lambda_scheduler_policy will be created
  + resource "aws_iam_policy" "scalable_lambda_scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "scalable-lambda-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda:*",
                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda",
                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda:*",
                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.scalable_lambda_scheduler_role will be created
  + resource "aws_iam_role" "scalable_lambda_scheduler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scalable-lambda-scheduler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.scalable_lambda_scheduler_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "scalable_lambda_scheduler_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scalable-lambda-scheduler-role"
    }

  # aws_lambda_function.scale_in_lambda will be updated in-place
  ~ resource "aws_lambda_function" "scale_in_lambda" {
        id                             = "algosolved-scale-in-lambda"
      ~ last_modified                  = "2024-06-04T14:41:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRRVebpkRFIY0lBWlFraieqPg7BHDpMbU1mIm8hl+yI=" -> "5mkzyfLQhljqyr1LAuRKO6mIb2CTlQifvdx4tYnrfbs="
        tags                           = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scale_out_lambda will be updated in-place
  ~ resource "aws_lambda_function" "scale_out_lambda" {
        id                             = "algosolved-scale-out-lambda"
      ~ last_modified                  = "2024-06-04T12:04:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "R4oAk8Fu/PtFtbwHljIiYyRsZJsIuLbG0rJIeiNHb0M=" -> "eqFqlhQV9fLb3/6D21yTsXyXlU/OXd2ga8uuzvBG9ns="
        tags                           = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.scale_in_lambda_perm will be destroyed
  # (because aws_lambda_permission.scale_in_lambda_perm is not in configuration)
  - resource "aws_lambda_permission" "scale_in_lambda_perm" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "algosolved-scale-in-lambda" -> null
      - id                  = "terraform-20240603164454120800000003" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-in-rule" -> null
      - statement_id        = "terraform-20240603164454120800000003" -> null
      - statement_id_prefix = "terraform-" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_permission.scale_out_lambda_perm will be destroyed
  # (because aws_lambda_permission.scale_out_lambda_perm is not in configuration)
  - resource "aws_lambda_permission" "scale_out_lambda_perm" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "algosolved-scale-out-lambda" -> null
      - id                  = "terraform-20240603164448751100000001" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-out-rule" -> null
      - statement_id        = "terraform-20240603164448751100000001" -> null
      - statement_id_prefix = "terraform-" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_scheduler_schedule.scale-in-schedule will be created
  + resource "aws_scheduler_schedule" "scale-in-schedule" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "scale-in-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 12 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda"
          + input    = jsonencode(
                {
                  + asg_name       = [
                      + "algosolved-ec2-asg",
                    ]
                  + rds_identifier = [
                      + "algosolved-rdb",
                    ]
                }
            )
          + role_arn = (known after apply)
        }
    }

  # aws_scheduler_schedule.scale-out-schedule will be created
  + resource "aws_scheduler_schedule" "scale-out-schedule" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "scale-out-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 9 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda"
          + input    = jsonencode(
                {
                  + asg_name       = [
                      + "algosolved-ec2-asg",
                    ]
                  + rds_identifier = [
                      + "algosolved-rdb",
                    ]
                }
            )
          + role_arn = (known after apply)
        }
    }

Plan: 5 to add, 3 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
2024-06-06T23:04:44.229Z [INFO]  backend-s3: Unlocking remote state: tf_backend.lock.id=63374e88-1163-742f-47b3-b0130bc6cdf5 tf_backend.operation=Unlock tf_backend.req_id=0d1aa173-5e53-41ec-752d-ac8b5847a022 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Arandom_string.password: Refreshing state... [id=M9axbhdBAI9j4gg4]%0Adata.archive_file.scale_in_lambda_to_zip: Reading...%0Adata.archive_file.scale_out_lambda_to_zip: Reading...%0Adata.archive_file.scale_in_lambda_to_zip: Read complete after 0s [id=3939add652a5f645d18fcb812736b4c7b6917dc0]%0Adata.archive_file.scale_out_lambda_to_zip: Read complete after 0s [id=ecddb466acb0c38687624ecf9b5e4842a008f2f8]%0Adata.aws_ami.ubuntu: Reading...%0Aaws_lambda_permission.scale_out_lambda_perm: Refreshing state... [id=terraform-20240603164448751100000001]%0Aaws_cloudwatch_event_rule.scale_out_rule: Refreshing state... [id=algosolved-scale-out-rule]%0Aaws_iam_role.lambda_role: Refreshing state... [id=scalable-lambda-role]%0Aaws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]%0Aaws_lambda_permission.scale_in_lambda_perm: Refreshing state... [id=terraform-20240603164454120800000003]%0Aaws_cloudwatch_event_rule.scale_in_rule: Refreshing state... [id=algosolved-scale-in-rule]%0Aaws_cloudwatch_event_target.scale_out_target: Refreshing state... [id=algosolved-scale-out-rule-terraform-20240603164448752600000002]%0Aaws_cloudwatch_event_target.scale_in_target: Refreshing state... [id=algosolved-scale-in-rule-terraform-20240603164454127300000004]%0Aaws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]%0Aaws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-04bcecd9b86d61bad]%0Aaws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f]%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-012edd67d8f2929e0]%0Aaws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]%0Aaws_lambda_function.scale_in_lambda: Refreshing state... [id=algosolved-scale-in-lambda]%0Aaws_lambda_function.scale_out_lambda: Refreshing state... [id=algosolved-scale-out-lambda]%0Aaws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=scalable-lambda-role-20240530100929042100000001]%0Aaws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=scalable-lambda-role-20240530100929356100000002]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-0572f73f0a5650b33]%0Aaws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-0ab2561671d221a8a]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0Aaws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/b2ca87625a4599c9/f8e55bf4f14dd805]%0Aaws_db_instance.algosolved-rdb: Refreshing state... [id=db-SNL2HKJ2U64PDP3APGN4QYFUME]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_event_rule.scale_in_rule will be destroyed%0A  # (because aws_cloudwatch_event_rule.scale_in_rule is not in configuration)%0A  - resource "aws_cloudwatch_event_rule" "scale_in_rule" {%0A      - arn                 = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-in-rule" -> null%0A      - description         = "Event bridge scale-in lambda" -> null%0A      - event_bus_name      = "default" -> null%0A      - event_pattern       = jsonencode(%0A            {%0A              - asg_name       = [%0A                  - "algosolved-ec2-asg",%0A                ]%0A              - rds_identifier = [%0A                  - "algosolved-rdb",%0A                ]%0A            }%0A        ) -> null%0A      - force_destroy       = false -> null%0A      - id                  = "algosolved-scale-in-rule" -> null%0A      - is_enabled          = true -> null%0A      - name                = "algosolved-scale-in-rule" -> null%0A      - state               = "ENABLED" -> null%0A      - tags                = {} -> null%0A      - tags_all            = {} -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_event_rule.scale_out_rule will be destroyed%0A  # (because aws_cloudwatch_event_rule.scale_out_rule is not in configuration)%0A  - resource "aws_cloudwatch_event_rule" "scale_out_rule" {%0A      - arn                 = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-out-rule" -> null%0A      - description         = "Event bridge scale-out lambda" -> null%0A      - event_bus_name      = "default" -> null%0A      - event_pattern       = jsonencode(%0A            {%0A              - asg_name       = [%0A                  - "algosolved-ec2-asg",%0A                ]%0A              - rds_identifier = [%0A                  - "algosolved-rdb",%0A                ]%0A            }%0A        ) -> null%0A      - force_destroy       = false -> null%0A      - id                  = "algosolved-scale-out-rule" -> null%0A      - is_enabled          = true -> null%0A      - name                = "algosolved-scale-out-rule" -> null%0A      - state               = "ENABLED" -> null%0A      - tags                = {} -> null%0A      - tags_all            = {} -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_in_target will be destroyed%0A  # (because aws_cloudwatch_event_target.scale_in_target is not in configuration)%0A  - resource "aws_cloudwatch_event_target" "scale_in_target" {%0A      - arn            = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda" -> null%0A      - event_bus_name = "default" -> null%0A      - force_destroy  = false -> null%0A      - id             = "algosolved-scale-in-rule-terraform-20240603164454127300000004" -> null%0A      - rule           = "algosolved-scale-in-rule" -> null%0A      - target_id      = "terraform-20240603164454127300000004" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_out_target will be destroyed%0A  # (because aws_cloudwatch_event_target.scale_out_target is not in configuration)%0A  - resource "aws_cloudwatch_event_target" "scale_out_target" {%0A      - arn            = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda" -> null%0A      - event_bus_name = "default" -> null%0A      - force_destroy  = false -> null%0A      - id             = "algosolved-scale-out-rule-terraform-20240603164448752600000002" -> null%0A      - rule           = "algosolved-scale-out-rule" -> null%0A      - target_id      = "terraform-20240603164448752600000002" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be updated in-place%0A  ~ resource "aws_ecr_repository" "algosolved_repository" {%0A        id                   = "algosolved-ecr"%0A        name                 = "algosolved-ecr"%0A      ~ tags                 = {%0A          - "Project" = "algosolved" -> null%0A          - "Stage"   = "prod" -> null%0A        }%0A      ~ tags_all             = {%0A          - "Project" = "algosolved" -> null%0A          - "Stage"   = "prod" -> null%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_iam_policy.scalable_lambda_scheduler_policy will be created%0A  + resource "aws_iam_policy" "scalable_lambda_scheduler_policy" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + id               = (known after apply)%0A      + name             = "scalable-lambda-scheduler-policy"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "lambda:InvokeFunction",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda:*",%0A                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda",%0A                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda:*",%0A                          + "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # aws_iam_role.scalable_lambda_scheduler_role will be created%0A  + resource "aws_iam_role" "scalable_lambda_scheduler_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "scheduler.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "scalable-lambda-scheduler-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.scalable_lambda_scheduler_policy_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "scalable_lambda_scheduler_policy_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "scalable-lambda-scheduler-role"%0A    }%0A%0A  # aws_lambda_function.scale_in_lambda will be updated in-place%0A  ~ resource "aws_lambda_function" "scale_in_lambda" {%0A        id                             = "algosolved-scale-in-lambda"%0A      ~ last_modified                  = "2024-06-04T14:41:51.000+0000" -> (known after apply)%0A      ~ source_code_hash               = "RRRVebpkRFIY0lBWlFraieqPg7BHDpMbU1mIm8hl+yI=" -> "5mkzyfLQhljqyr1LAuRKO6mIb2CTlQifvdx4tYnrfbs="%0A        tags                           = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (26 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_lambda_function.scale_out_lambda will be updated in-place%0A  ~ resource "aws_lambda_function" "scale_out_lambda" {%0A        id                             = "algosolved-scale-out-lambda"%0A      ~ last_modified                  = "2024-06-04T12:04:20.000+0000" -> (known after apply)%0A      ~ source_code_hash               = "R4oAk8Fu/PtFtbwHljIiYyRsZJsIuLbG0rJIeiNHb0M=" -> "eqFqlhQV9fLb3/6D21yTsXyXlU/OXd2ga8uuzvBG9ns="%0A        tags                           = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (26 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_lambda_permission.scale_in_lambda_perm will be destroyed%0A  # (because aws_lambda_permission.scale_in_lambda_perm is not in configuration)%0A  - resource "aws_lambda_permission" "scale_in_lambda_perm" {%0A      - action              = "lambda:InvokeFunction" -> null%0A      - function_name       = "algosolved-scale-in-lambda" -> null%0A      - id                  = "terraform-20240603164454120800000003" -> null%0A      - principal           = "events.amazonaws.com" -> null%0A      - source_arn          = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-in-rule" -> null%0A      - statement_id        = "terraform-20240603164454120800000003" -> null%0A      - statement_id_prefix = "terraform-" -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_lambda_permission.scale_out_lambda_perm will be destroyed%0A  # (because aws_lambda_permission.scale_out_lambda_perm is not in configuration)%0A  - resource "aws_lambda_permission" "scale_out_lambda_perm" {%0A      - action              = "lambda:InvokeFunction" -> null%0A      - function_name       = "algosolved-scale-out-lambda" -> null%0A      - id                  = "terraform-20240603164448751100000001" -> null%0A      - principal           = "events.amazonaws.com" -> null%0A      - source_arn          = "arn:aws:events:ap-northeast-2:471112990651:rule/algosolved-scale-out-rule" -> null%0A      - statement_id        = "terraform-20240603164448751100000001" -> null%0A      - statement_id_prefix = "terraform-" -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_scheduler_schedule.scale-in-schedule will be created%0A  + resource "aws_scheduler_schedule" "scale-in-schedule" {%0A      + arn                          = (known after apply)%0A      + group_name                   = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "scale-in-schedule"%0A      + name_prefix                  = (known after apply)%0A      + schedule_expression          = "cron(0 12 * * ? *)"%0A      + schedule_expression_timezone = "UTC"%0A      + state                        = "ENABLED"%0A%0A      + flexible_time_window {%0A          + mode = "OFF"%0A        }%0A%0A      + target {%0A          + arn      = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-in-lambda"%0A          + input    = jsonencode(%0A                {%0A                  + asg_name       = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + rds_identifier = [%0A                      + "algosolved-rdb",%0A                    ]%0A                }%0A            )%0A          + role_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_scheduler_schedule.scale-out-schedule will be created%0A  + resource "aws_scheduler_schedule" "scale-out-schedule" {%0A      + arn                          = (known after apply)%0A      + group_name                   = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "scale-out-schedule"%0A      + name_prefix                  = (known after apply)%0A      + schedule_expression          = "cron(0 9 * * ? *)"%0A      + schedule_expression_timezone = "UTC"%0A      + state                        = "ENABLED"%0A%0A      + flexible_time_window {%0A          + mode = "OFF"%0A        }%0A%0A      + target {%0A          + arn      = "arn:aws:lambda:ap-northeast-2:471112990651:function:algosolved-scale-out-lambda"%0A          + input    = jsonencode(%0A                {%0A                  + asg_name       = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + rds_identifier = [%0A                      + "algosolved-rdb",%0A                    ]%0A                }%0A            )%0A          + role_arn = (known after apply)%0A        }%0A    }%0A%0APlan: 5 to add, 3 to change, 6 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-06-06T23:04:35.479Z [INFO]  Terraform version: 1.8.1%0A2024-06-06T23:04:35.479Z [INFO]  Go runtime version: go1.22.1%0A2024-06-06T23:04:35.479Z [INFO]  CLI args: []string{"/home/runner/work/_temp/5c36d845-c623-4608-9113-f224d1f41f23/terraform-bin", "plan", "-no-color"}%0A2024-06-06T23:04:35.479Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-06-06T23:04:35.486Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-06-06T23:04:36.238Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-06-06T23:04:36.416Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=983615c5-bab0-c038-16be-9bf841e6f9e5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-06-06T23:04:36.795Z [INFO]  backend/local: starting Plan operation%0A2024-06-06T23:04:37.457Z [INFO]  backend-s3: Locking remote state: tf_backend.lock.id=63374e88-1163-742f-47b3-b0130bc6cdf5 tf_backend.lock.info="" tf_backend.lock.operation=OperationTypePlan tf_backend.lock.path=algosolved-terraform-s3/infra/prod/terraform.tfstate tf_backend.lock.version=1.8.1 tf_backend.lock.who=runner@fv-az1427-422 tf_backend.operation=Lock tf_backend.req_id=d42cf791-57d4-c2e5-6059-22004259f33e tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-06-06T23:04:38.037Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=5ee0c396-e121-8e5c-dc29-a964e7332d6c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-06-06T23:04:38.844Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:38.861Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:38.861Z%0A2024-06-06T23:04:38.912Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:38.983Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:38.983Z%0A2024-06-06T23:04:39.590Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:39.599Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.599Z%0A2024-06-06T23:04:39.630Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:39.638Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.638Z%0A2024-06-06T23:04:39.661Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:39.669Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.669Z%0A2024-06-06T23:04:39.717Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:39.797Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.796Z%0A2024-06-06T23:04:39.922Z [INFO]  backend/local: plan calling Plan%0A2024-06-06T23:04:39.928Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:39.936Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:39.936Z%0A2024-06-06T23:04:39.959Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:40.039Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:40.039Z%0A2024-06-06T23:04:40.063Z [INFO]  provider: configuring client automatic mTLS%0A2024-06-06T23:04:40.074Z [INFO]  provider.terraform-provider-archive_v2.4.2_x5: configuring server automatic mTLS: timestamp=2024-06-06T23:04:40.073Z%0A2024-06-06T23:04:40.166Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_req_id=1b44760b-2727-194a-04a8-828be64983b8 tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-06-06T23:04:40.166Z%0A2024-06-06T23:04:40.899Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_req_id=1b44760b-2727-194a-04a8-828be64983b8 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2024-06-06T23:04:40.899Z%0A2024-06-06T23:04:41.150Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-06-06T23:04:41.169Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A2024-06-06T23:04:41.179Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A2024-06-06T23:04:41.710Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.scalable_lambda_scheduler_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-06-06T23:04:41.713Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.scalable_lambda_scheduler_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A2024-06-06T23:04:42.078Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-06-06T23:04:42.224Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A      - .tags_all: planned value cty.MapValEmpty(cty.String) does not match config value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")}) nor prior value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")})%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)%0A      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)%0A2024-06-06T23:04:42.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-06-06T23:04:42.316Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.scale_in_lambda during refresh.%0A      - .last_modified: was cty.StringVal("2024-06-04T10:17:29.000+0000"), but now cty.StringVal("2024-06-04T14:41:51.000+0000")%0A      - .source_code_hash: was cty.StringVal("Fa/TtvyK8ZB5ZREtZ0PWFEcECO6jcvabx1/yjQpgGGs="), but now cty.StringVal("RRRVebpkRFIY0lBWlFraieqPg7BHDpMbU1mIm8hl+yI=")%0A      - .source_code_size: was cty.NumberIntVal(824), but now cty.NumberIntVal(978)%0A2024-06-06T23:04:42.317Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.scale_out_lambda during refresh.%0A      - .last_modified: was cty.StringVal("2024-06-04T10:17:34.000+0000"), but now cty.StringVal("2024-06-04T12:04:20.000+0000")%0A      - .source_code_hash: was cty.StringVal("wGOROH2qqDoa7o+ItJvesJZAXcuC5uO3lwB4q5e5PtQ="), but now cty.StringVal("R4oAk8Fu/PtFtbwHljIiYyRsZJsIuLbG0rJIeiNHb0M=")%0A      - .source_code_size: was cty.NumberIntVal(827), but now cty.NumberIntVal(847)%0A2024-06-06T23:04:42.330Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .image_uri: planned value cty.StringVal("") for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)%0A      - .logging_config: block count in plan (1) disagrees with count in config (0)%0A      - .tracing_config: block count in plan (1) disagrees with count in config (0)%0A2024-06-06T23:04:42.330Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .image_uri: planned value cty.StringVal("") for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .logging_config: block count in plan (1) disagrees with count in config (0)%0A      - .tracing_config: block count in plan (1) disagrees with count in config (0)%0A      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)%0A2024-06-06T23:04:42.418Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute%0A      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute%0A      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute%0A      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .health_check[0].enabled: planned value cty.True for a non-computed attribute%0A      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute%0A      - .stickiness: block count in plan (1) disagrees with count in config (0)%0A      - .target_failover: block count in plan (1) disagrees with count in config (0)%0A      - .target_health_state: block count in plan (1) disagrees with count in config (0)%0A2024-06-06T23:04:42.730Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .disable_api_stop: planned value cty.False for a non-computed attribute%0A      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute%0A      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .disable_api_termination: planned value cty.False for a non-computed attribute%0A      - .user_data: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute%0A2024-06-06T23:04:43.064Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .customer_owned_ipv4_pool: planned value cty.StringVal("") for a non-computed attribute%0A      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute%0A      - .enable_cross_zone_load_balancing: planned value cty.True for a non-computed attribute%0A      - .enable_xff_client_port: planned value cty.False for a non-computed attribute%0A      - .preserve_host_header: planned value cty.False for a non-computed attribute%0A      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute%0A      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute%0A      - .enable_http2: planned value cty.True for a non-computed attribute%0A      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute%0A      - .enable_deletion_protection: planned value cty.False for a non-computed attribute%0A      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute%0A      - .access_logs: block count in plan (1) disagrees with count in config (0)%0A      - .connection_logs: block count in plan (1) disagrees with count in config (0)%0A2024-06-06T23:04:43.285Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute%0A2024-06-06T23:04:43.575Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .capacity_rebalance: planned value cty.False for a non-computed attribute%0A      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .context: planned value cty.StringVal("") for a non-computed attribute%0A      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .placement_group: planned value cty.StringVal("") for a non-computed attribute%0A      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A2024-06-06T23:04:43.695Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute%0A      - .domain_auth_secret_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .enabled_cloudwatch_logs_exports: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .iam_database_authentication_enabled: planned value cty.False for a non-computed attribute%0A      - .publicly_accessible: planned value cty.False for a non-computed attribute%0A      - .delete_automated_backups: planned value cty.True for a non-computed attribute%0A      - .domain_ou: planned value cty.StringVal("") for a non-computed attribute%0A      - .performance_insights_enabled: planned value cty.False for a non-computed attribute%0A      - .apply_immediately: planned value cty.False for a non-computed attribute%0A      - .dedicated_log_volume: planned value cty.False for a non-computed attribute%0A      - .deletion_protection: planned value cty.False for a non-computed attribute%0A      - .replicate_source_db: planned value cty.StringVal("") for a non-computed attribute%0A      - .skip_final_snapshot: planned value cty.False for a non-computed attribute%0A      - .domain: planned value cty.StringVal("") for a non-computed attribute%0A      - .max_allocated_storage: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .custom_iam_instance_profile: planned value cty.StringVal("") for a non-computed attribute%0A      - .domain_dns_ips: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .storage_encrypted: planned value cty.False for a non-computed attribute%0A      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute%0A      - .customer_owned_ip_enabled: planned value cty.False for a non-computed attribute%0A      - .domain_iam_role_name: planned value cty.StringVal("") for a non-computed attribute%0A2024-06-06T23:04:43.700Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_scheduler_schedule.scale-in-schedule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .schedule_expression_timezone: planned value cty.StringVal("UTC") for a non-computed attribute%0A      - .state: planned value cty.StringVal("ENABLED") for a non-computed attribute%0A2024-06-06T23:04:43.700Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_scheduler_schedule.scale-out-schedule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .schedule_expression_timezone: planned value cty.StringVal("UTC") for a non-computed attribute%0A      - .state: planned value cty.StringVal("ENABLED") for a non-computed attribute%0A2024-06-06T23:04:44.129Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .default_action[0].target_group_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute%0A      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute%0A      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute%0A2024-06-06T23:04:44.164Z [INFO]  backend/local: plan operation completed%0A2024-06-06T23:04:44.229Z [INFO]  backend-s3: Unlocking remote state: tf_backend.lock.id=63374e88-1163-742f-47b3-b0130bc6cdf5 tf_backend.operation=Unlock tf_backend.req_id=0d1aa173-5e53-41ec-752d-ac8b5847a022 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A
::debug::exitcode: 0

```

</details>




**Pusher: @youngjun0627**